src/cf/src/DataProcessors/ЛичныйКабинетПартнера/ЛичныйКабинетПартнера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЛичныйКабинетПартнера</name>
  <tabularSections>
    <name>Корзина</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаЗаказов</name>
    <attributes>
      <name>ДокументЗаказа</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>КартинкаОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаказа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оплачено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КнопкаРазвернуть</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КнопкаПовтора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Развернуто</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаЗаявок</name>
    <attributes>
      <name>ДокументЗаявки</name>
      <type>
        <types>DocumentRef.ЗаявкаНаПоискТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаявки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаявки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаявки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/cf/src/InformationRegisters/ПрисоединённыеФайлы/ПрисоединённыеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрисоединённыеФайлы</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Внешний</name>
    <comment>Признак хранения файла на диске</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ВладельцыПрисоединенныхФайлов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Связь</name>
    <comment>Связь со внутренним реквизитом объекта</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <comment>Идентификатор файла, так же служит для связи c файлом на диске</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ДинамическаяКорзинаЛКП/ДинамическаяКорзинаЛКП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДинамическаяКорзинаЛКП</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Allow</posting>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КоммерческоеПредложение</types>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСWEBСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПодтвердилПроверилОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаказаПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Техкарта</name>
      <type>
        <types>DocumentRef.ТехнологическаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиПродукции</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиРодителя</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаЕдиницу</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/DataProcessors/ЛичныйКабинетПартнера/Forms/ФормаИстории/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТаблицаЗаказов = ПолучитьТаблицуЗаказов();    
	
	ГруппаЗаказаов = Элементы.ГруппаЗаказаов;
	
	Если ТаблицаЗаказов.Количество() = 0 Тогда
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("КартинкаВсе", Тип("ДекорацияФормы"),ГруппаЗаказаов);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "Achats manquants"; 
		НовыйЭлемент.Шрифт = Новый Шрифт(, 26, Истина, , , ) ; 
		НовыйЭлемент.ЦветТекста = WebЦвета.Серый;
	Иначе
		сч = 0;  
		сч1 = 0;
		Для каждого стр из ТаблицаЗаказов Цикл
			сч = сч + 1;	
			ГруппаКнопок1 = ЭтаФорма.Элементы.Добавить("ГруппаОбычная"+Строка(сч), Тип("ГруппаФормы"),ГруппаЗаказаов);
			ГруппаКнопок1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаКнопок1.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаКнопок1.ОтображатьЗаголовок = ЛОЖЬ; 
			ГруппаКнопок1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно; 
			
			ГруппаКнопок2 = ЭтаФорма.Элементы.Добавить("ГруппаВерт"+Строка(сч), Тип("ГруппаФормы"),ГруппаКнопок1);
			ГруппаКнопок2.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаКнопок2.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаКнопок2.ОтображатьЗаголовок = ЛОЖЬ; 
			ГруппаКнопок2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
			
			ДокДат = стр.ЗаказПокупателя.Дата;
			ДД = Строка(День(ДокДат));
			ММ = МесяцаПоФр(Месяц(ДокДат));  
			гг = Строка(СтрЗаменить(Год(ДокДат),Символы.НПП,""));
			
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("КартинкаДат"+Строка(сч), Тип("ДекорацияФормы"),ГруппаКнопок2);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок = ДД+" "+ММ+" "+гг; 
			НовыйЭлемент.Шрифт = Новый Шрифт(, 18, Истина, , , ) ; 
			НовыйЭлемент.ЦветТекста = WebЦвета.Серый;
			
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("КартинкаНомер"+Строка(сч), Тип("ДекорацияФормы"),ГруппаКнопок2);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок = стр.ЗаказПокупателя.Номер; 
			НовыйЭлемент.Шрифт = Новый Шрифт(, 12, Истина, , , ) ; 
			НовыйЭлемент.ЦветТекста = WebЦвета.Серый;
			
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("КартинкаСумма"+Строка(сч), Тип("ДекорацияФормы"),ГруппаКнопок2);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок = Строка(стр.ЗаказПокупателя.ТЧТовары.Итог("Сумма")); 
			НовыйЭлемент.Шрифт = Новый Шрифт(, 12, Истина, , , ) ; 
			НовыйЭлемент.ЦветТекста = WebЦвета.Серый;  
			
			НоваяКомандаПлюс = ЭтаФорма.Команды.Добавить("КомПовтор"+стр.ЗаказПокупателя.Номер);
			НоваяКомандаПлюс.Заголовок = Нстр("fr = 'Répéter'; ru = 'Повторить'; en = 'Repeat'; es = 'Repetir'"); 
			НоваяКомандаПлюс.Подсказка = Нстр("fr = 'Retirer la commande dans le panier'; ru = 'Вывести заказ в корзину'; en = 'Add an order to the shopping cart'; es = 'Enviar pedido al carrito'"); 
			НоваяКомандаПлюс.Действие = "ПовторитьЗаказЛКП";  
			
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Повтор"+СокрЛП(сч), Тип("КнопкаФормы"),ГруппаКнопок2);
			НовыйЭлемент.Заголовок = Нстр("fr = 'Répéter'; ru = 'Повторить'; en = 'Repeat'; es = 'Repetir'"); 
			НовыйЭлемент.Шрифт = Новый Шрифт(, 14, Истина, , , ) ;
			НовыйЭлемент.ИмяКоманды = "КомПовтор"+стр.ЗаказПокупателя.Номер;    
			
			Для каждого тов из стр.ЗаказПокупателя.ТЧТовары Цикл  
			сч1 = сч1 + 1;	
				ГруппаКнопок2Тов = ЭтаФорма.Элементы.Добавить("ГруппаВерт"+Строка(сч1)+Строка(сч), Тип("ГруппаФормы"),ГруппаКнопок1);
				ГруппаКнопок2Тов.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаКнопок2Тов.Отображение = ОтображениеОбычнойГруппы.Нет;
				ГруппаКнопок2Тов.ОтображатьЗаголовок = ЛОЖЬ; 
				ГруппаКнопок2Тов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
				
				ДобавляемыеРеквизиты = Новый Массив; 
				НовыйРеквизит = Новый РеквизитФормы("Наим"+Строка(сч1)+"Тов"+Строка(сч)+СокрЛП(тов.Номенклатура.Код),Новый ОписаниеТипов("Строка"));  
				ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);        
				НовыйРеквизит = Новый РеквизитФормы("Карт"+Строка(сч1)+"Тов"+Строка(сч)+СокрЛП(тов.Номенклатура.Код),Новый ОписаниеТипов("Строка"));  
				ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);        
				ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
				
				
				НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Карт"+Строка(сч1)+"Тов"+Строка(сч)+СокрЛП(тов.Номенклатура.Код), Тип("ПолеФормы"),ГруппаКнопок2Тов);
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеКартинки;   
				НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
				НовыйЭлемент.ПутьКДанным = "Карт"+Строка(сч1)+"Тов"+Строка(сч)+СокрЛП(тов.Номенклатура.Код);
				НовыйЭлемент.РастягиватьПоВертикали = Ложь;
				НовыйЭлемент.РастягиватьПоГоризонтали = Ложь; 
				НовыйЭлемент.РазмерКартинки = РазмерКартинки.Пропорционально;
				НовыйЭлемент.Ширина = 5;
				НовыйЭлемент.Высота = 2;
				НовыйЭлемент.Рамка= Новый Рамка(ТипРамкиЭлементаУправления.БезРамки); 
				
				ВывестиКартинкуНоменклатурыВКорзину(тов.Номенклатура, "Карт"+Строка(сч1)+"Тов"+Строка(сч)+СокрЛП(тов.Номенклатура.Код));
				
				
				НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Наим"+Строка(сч1)+"Тов"+Строка(сч)+СокрЛП(тов.Номенклатура.Код), Тип("ПолеФормы"),ГруппаКнопок2Тов);
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.МногострочныйРежим = Истина;
				НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
				НовыйЭлемент.ПутьКДанным = "Наим"+Строка(сч1)+"Тов"+Строка(сч)+СокрЛП(тов.Номенклатура.Код);
				НовыйЭлемент.РастягиватьПоВертикали = Ложь;
				НовыйЭлемент.РастягиватьПоГоризонтали = Ложь; 
				НовыйЭлемент.ЦветРамки = ЦветаСтиля.ЦветФонаФормы; 
				НовыйЭлемент.Шрифт = Новый Шрифт(, 12, Ложь, , , ) ;
				новыйЭлемент.Доступность = Ложь;
				
				ЭтотОбъект["Наим"+Строка(сч1)+"Тов"+Строка(сч)+СокрЛП(тов.Номенклатура.Код)]	=  СокрЛП(тов.Номенклатура.Наименование);  
				
				
				НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Сум"+Строка(сч1)+"Тов"+Строка(сч)+СокрЛП(тов.Номенклатура.Код), Тип("ДекорацияФормы"),ГруппаКнопок2Тов);
				НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
				НовыйЭлемент.Заголовок = Строка(тов.Сумма); 
				НовыйЭлемент.Шрифт = Новый Шрифт(, 12, Ложь, , , ) ; 
				НовыйЭлемент.ЦветТекста = WebЦвета.Серый; 
				
				
			КонецЦикла;
			
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("КартинкаИтог"+Строка(сч), Тип("ДекорацияФормы"),ГруппаЗаказаов);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок = ""; 
			НовыйЭлемент.Шрифт = Новый Шрифт(, 26, Истина, , , ) ; 
			НовыйЭлемент.ЦветТекста = WebЦвета.Серый;		
		КонецЦикла;
		
	КонецЕсли;
	
	Этаформа.Заголовок = Нстр("en = 'Purchase history'; es = 'Historial de compras'; fr = 'Historique des achats'; ru = 'История покупок'");
	
КонецПроцедуры  

&НаСервере
Процедура ВывестиКартинкуНоменклатурыВКорзину(СсылкаТовара, НаименРеквизита)
	
	НЗ = РегистрыСведений.ПрисоединённыеФайлы.СоздатьНаборЗаписей();
	НЗ.Отбор.Объект.Установить(СсылкаТовара.Ссылка);
	НЗ.Прочитать();   
	Для каждого стр из НЗ Цикл 
		Если стр.Расширение = "jpg" или стр.Расширение = "png" или стр.Расширение = "jpeg" Тогда
			ID = стр.ID;      
		КонецЕсли;
	КонецЦикла;     
	
	КлючЗаписиРег = РегистрыСведений.ПрисоединённыеФайлы.СоздатьКлючЗаписи(Новый Структура("Объект,ID", СсылкаТовара.Ссылка,ID));
	
	Если Не КлючЗаписиРег.Пустой() Тогда
		ЭтотОбъект[НаименРеквизита] = ПолучитьНавигационнуюСсылку(КлючЗаписиРег, "Данные");
	КонецЕсли;   
	
КонецПроцедуры


&НаСервере
Функция МесяцаПоФр(мес)
	
	Если мес = 1 тогда
		Возврат Нстр("fr = 'janvier'; ru = 'января'; en = 'January'; es = 'enero'");
	ИначеЕсли мес = 2 тогда
		Возврат Нстр("fr = 'février'; ru = 'февраля'; en = 'February'; es = 'febrero'");      
	ИначеЕсли мес = 3 тогда
		Возврат Нстр("fr = 'mars'; ru = 'марта'; en = 'martha'; es = 'Marta'");  
	ИначеЕсли мес = 4 тогда
		Возврат Нстр("fr = 'avril'; ru = 'апреля'; en = 'april'; es = 'abril'");  
	ИначеЕсли мес = 5 тогда
		Возврат Нстр("fr = 'mai'; ru = 'мая'; en = 'May'; es = 'mayo'");  
	ИначеЕсли мес = 6 тогда
		Возврат Нстр("fr = 'juin'; ru = 'июля'; en = ""July's""; es = 'julio'");  
	ИначеЕсли мес = 7 тогда
		Возврат Нстр("fr = 'juillet'; ru = 'июня'; en = ""June's""; es = 'junio'");  
	ИначеЕсли мес = 8 тогда
		Возврат Нстр("fr = 'août'; ru = 'августа'; en = 'august'; es = 'agosto'");  
	ИначеЕсли мес = 9 тогда
		Возврат Нстр("fr = 'septembre'; ru = 'сентября'; en = 'september'; es = 'septiembre'"); 
	ИначеЕсли мес = 10 тогда
		Возврат Нстр("fr = 'octobre'; ru = 'октября'; en = ""October's""; es = 'octubre'");  
	ИначеЕсли мес = 11 тогда
		Возврат Нстр("fr = 'novembre'; ru = 'ноября'; en = ""November's""; es = 'noviembre'");  
	ИначеЕсли мес = 12 тогда
		Возврат Нстр("fr = 'décembre'; ru = 'декабря'; en = 'december'; es = 'diciembre'");  
	КонецЕсли;
	
КонецФункции   

&НаСервере
Функция ПолучитьТаблицуЗаказов()
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	ДинамическаяКорзинаЛКП.ЗаказПокупателя КАК ЗаказПокупателя
	                |ИЗ
	                |	РегистрСведений.ДинамическаяКорзинаЛКП КАК ДинамическаяКорзинаЛКП
	                |ГДЕ
	                |	ДинамическаяКорзинаЛКП.Пользователь = &Пользователь
	                |	И ДинамическаяКорзинаЛКП.ЗаказПокупателя <> &ПустойЗаказ
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ДинамическаяКорзинаЛКП.ЗаказПокупателя.Дата УБЫВ"; 
	Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.Пользователь);  
	Запрос.УстановитьПараметр("ПустойЗаказ",Документы.ЗаказПокупателя.ПустаяСсылка());  
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции     

&НаКлиенте
Процедура ПовторитьЗаказЛКП(Команда)
	
	НомЗаказа = СтрЗаменить(Команда.Имя,"КомПовтор",""); 
	
    ПовторитьЗаказЛКПНаСервере(НомЗаказа);  
	
	ЭтаФорма.Закрыть("ОК");
	
КонецПроцедуры 

&НаСервере
Процедура ПовторитьЗаказЛКПНаСервере(НомЗаказа)
	
    Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЗаказПокупателяТЧТовары.Номенклатура КАК Номенклатура,
	                |	ЗаказПокупателяТЧТовары.Количество КАК Количество,
	                |	ЗаказПокупателяТЧТовары.Цена КАК Цена,
	                |	ЗаказПокупателяТЧТовары.Сумма КАК Сумма
	                |ИЗ
	                |	Документ.ЗаказПокупателя.ТЧТовары КАК ЗаказПокупателяТЧТовары
	                |ГДЕ
	                |	ЗаказПокупателяТЧТовары.Ссылка.Номер = &НомерЗаказа";
	Запрос.УстановитьПараметр("НомерЗаказа",НомЗаказа);
	
	объект.Корзина.Очистить(); 
	
	Выборка = запрос.Выполнить().Выбрать();
	
	Пока выборка.Следующий() Цикл
		тт = объект.Корзина.Добавить();
		ЗаполнитьЗначенияСвойств(тт,выборка);
	КонецЦикла; 
	
	ЗапомнитьДинамическиКорзину();
	
КонецПроцедуры 

&НаСервере
Процедура ЗапомнитьДинамическикорзину()    
	
	НаборЗаписей = РегистрыСведений.ДинамическаяКорзинаЛКП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(ПараметрыСеанса.Пользователь);   
	НаборЗаписей.Отбор.ЗаказПокупателя.Установить(Документы.ЗаказПокупателя.ПустаяСсылка());   
	НаборЗаписей.Прочитать();  
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать(Истина);
	
	НаборЗаписей = РегистрыСведений.ДинамическаяКорзинаЛКП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(ПараметрыСеанса.Пользователь);   
	НаборЗаписей.Отбор.ЗаказПокупателя.Установить(Документы.ЗаказПокупателя.ПустаяСсылка());  	
	Для каждого стр из объект.Корзина цикл
		Запись01 = НаборЗаписей.Добавить();   
		Запись01.Период = ТекущаяДата();		
		Запись01.Пользователь = ПараметрыСеанса.Пользователь;
		Запись01.Номенклатура = Стр.Номенклатура;
		Запись01.Количество = Стр.Количество;
		Запись01.Цена = Стр.Цена;
		Запись01.Сумма = Стр.Сумма;
	КонецЦикла; 
	
	НаборЗаписей.Записать(); 
	
КонецПроцедуры
